// if1
// let a = +prompt("Введите число")
// if (a > 0) {
//     alert(++a)
// } else {
//     alert(a)
// }


// if2
// let a = +prompt("Введите число")
// if (a > 0) {
//     alert(a + 1)
// } else {
//     alert(a - 2)    
// }


// if3
// let a = +prompt("Введите ваше число")
// if (a > 0) {
//     alert(a + 1)
// } else if (a < 0) {
//     alert( a - 2)
// } else {
//     alert(a = 10)
// }


// // if4
// let a = +prompt("Введите первое число")
// let b = +prompt("Введите второе число")
// let c = +prompt("Введите третье число")
// if (a > 0 && b > 0 && c > 0) {
//     alert("Вы ввели три положительных числа")
// } else if (a > 0 && b > 0 && c < 0) {
//     alert ("Вы ввели два положительных числа")
// } else if (a > 0 && b <= 0 && c > 0) {
//     alert ("Вы ввели два положительных числа")
// } else if (a <= 0 && b > 0 && c > 0) {
//     alert("Вы ввели два положительных числа")
// } else if (a <= 0 && b <= 0 && c > 0) {
//     alert("Вы ввели только одно положительных числа")
// } else if (a > 0 && b <= 0 && c <= 0) {
//     alert("Вы ввели только одно положительных числа")
// } else if (a <= 0 && b > 0 && c <= 0) {
//     alert("Вы ввели только одно положительных числа")
// } else {
//     alert("Вы не ввели положитльных чисел")
// }


// if 5
// let a = +prompt("Введите первое число")
// let b = +prompt("Введите второе число")
// let c = +prompt("Введите третье число")
// if (a > 0 && b > 0 && c > 0) {
//     alert("Вы ввели три положительных числа")
// } else if (a > 0 && b > 0 && c < 0) {
//     alert ("Вы ввели два положительных числа и одно отрицательное")
// } else if (a > 0 && b < 0 && c > 0) {
//     alert ("Вы ввели два положительных числа и одно отрицательное")
// } else if (a < 0 && b > 0 && c > 0) {
//     alert("Вы ввели два положительных числа и одно отрицательное")
// } else if (a < 0 && b < 0 && c > 0) {
//     alert("Вы ввели одно положительных числа и два отрицательных")
// } else if (a > 0 && b < 0 && c < 0) {
//     alert("Вы ввели одно положительных числа и два отрицательных")
// } else if (a < 0 && b > 0 && c < 0) {
//     alert("Вы ввели одно положительных числа и два отрицательных")
// } else if (a < 0 && b < 0 && c < 0){
//     alert("Вы ввели три отрицательных числа")
// } 

// if 6
// let a = +prompt("Введите первое число")
// let b = +prompt("Введите второе число")
// if (a > b) {
//     alert(a)
// } else if (a < b) {
//     alert(b)
// } else {
//     alert("Ошибка")
// }


// if 7
// let a = +prompt("Введите первое число")
// let b = +prompt("Введите второе число")
// if (a > b) {
//     alert("Порядковый номер меньшего числа: 2")
// } else if (a < b) {
//     alert("Порядковый номер меньшего числа: 1")
// } else {
//     alert("Ошибка")
// }


// if 8
// let a = +prompt("Введите первое число")
// let b = +prompt("Введите второе число")
// if (a > b) {
//     alert("Большее число из двух заданных: " + a)
//     alert("Меньшее число из двух заданных: " + b)
// } else if (a < b){
//     alert("Большее число из двух заданных: " + b)
//     alert("Меньшее число из двух заданных: " + a)
// } else {
//     alert("Заданные числа равны")
// }


// if 9
// let a = +prompt("Введите первое число")
// let b = +prompt("Введите второе число")
// if (a > b) {
//     alert("Значение а: " + b)
//     alert("Значение b: " + a)
// } else if (a < b){
//     alert("Значение а: " + a)
//     alert("Значение b: " + b)
// } else {
//     alert("Заданные числа равны, задача не может быть выполнена")
// }


// if 10
// let a = +prompt("Введите первое число")
// let b = +prompt("Введите второе число")
// if (a != b) {
//     alert("Значение a: " + (a+b))
//     alert("Значение b: " + (a+b))
// } else {
//     alert("Значение a: " + (a=0))
//     alert("Значение b: " + (b=0))
// }


// if 11
// let a = +prompt("Введите первое число")
// let b = +prompt("Введите второе число")
// if (a != b) {
//     if (a > b) {
//         alert("Значение a: " + a)
//         alert("Значение b: " + a)
//     } else {
//         alert("Значение a: " + b)
//         alert("Значение b: " + b)
//     }
// } else {
//     alert("Значение a: " + (a=0))
//     alert("Значение b: " + (b=0))
// }


// if 12
// let a = +prompt("Введите первое число")
// let b = +prompt("Введите второе число")
// let c = +prompt("Введите третье число")
// if (a < b) {
//     if (a < c) {
//         alert("Меньшее из заданых чисел: " + a)
//     } else {
//         alert("Меньшее из заданых чисел: " + c)
//     }
// } else {
//     if (b < c) {
//         alert("Меньшее из заданых чисел: " + b)
//     } else {
//         alert("Меньшее из заданых чисел: " + c)
//     }
// }


// if 13
// let a = +prompt("Введите первое число")
// let b = +prompt("Введите второе число")
// let c = +prompt("Введите третье число")
// if (a > b) {
//     if (a < c) {
//         alert("Число со средним значением: " + a)
//     } else if (b > c) {
//         alert("Число со средним значением: " + b)
//     } else {
//         alert("Число со средним значением: " + c)
//     }
// } else {
//     if (a > c) {
//         alert("Число со средним значением: " + a)
//     } else if (b > c) {
//         alert("Число со средним значением: " + c)
//     } else {
//         alert("Число со средним значением: " + b)
//     }
// }


// if 14 
// let a = +prompt("Введите первое число")
// let b = +prompt("Введите второе число")
// let c = +prompt("Введите третье число")
// if (a > b) {
//     if (a > c) {
//        if (b > c) {
//            alert("Число с найменьшим значением: " + c)
//            alert("Число с найбольшим значением: " + a)
//        } else {
//             alert("Число с найменьшим значением: " + b)
//             alert("Число с найбольшим значением: " + a)
//        }
//     } 
// } else {
//     if (b > c) {
//         if (a > c) {
//             alert("Число с найменьшим значением: " + c)
//             alert("Число с найбольшим значением: " + b)  
//         } else {
//             alert("Число с найменьшим значением: " + a)
//             alert("Число с найбольшим значением: " + b)
//         }
//     } else {
//         alert("Число с найменьшим значением: " + a)
//         alert("Число с найбольшим значением: " + c)
//     }
// }


// if 15
// let a = +prompt("Введите первое число")
// let b = +prompt("Введите второе число")
// let c = +prompt("Введите третье число")
// if (a > b) {
//     if (a > c) {
//         if (b > c) {
//             alert("Сумма двух найбольших чисел: " + (a + b))
//         } else {
//             alert("Сумма двух найбольших чисел: " + (a + c))
//         }
//     } else {
//         alert("Сумма двух найбольших чисел: " + (c + a))
//     }
// } else {
//     if (b > c) {
//         if (a > c) {
//             alert("Сумма двух найбольших чисел: " + (b + a)) 
//         } else {
//             alert("Сумма двух найбольших чисел: " + (b + c)) 
//         }
//     } else {
//         alert("Сумма двух найбольших чисел: " + (b + c)) 
//     }
// }